"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить 
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь: 
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат 
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def main():

    age = input('Сколько тебе лет? ')
    age = int(age)
    if age > 0: 
        if age < 7:
            return print(f'{age}? Ходишь в детсад?')
        elif age >= 7 and age <= 18:
            return print(f'{age} лет? Я в этом возрасте в школу ходил.')
        elif age > 18 and age <= 23:
            return print(f'В {age} я уже в ВУЗе учился.')
        else:
             return print(f'Видимо, работаешь, в {age}-то лет?')
    else:
        return print('Ты несёшь чепуху.')

if __name__ == "__main__":
    main()
